MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5013/mcu.h
#define _DCICON1_COFSD_POSITION                  0x00000008
#define _DCICON1_COFSD_MASK                      0x00000100
#define _DCICON1_COFSD_LENGTH                    0x00000001

#define _DCICON1_CSCKE_POSITION                  0x00000009
#define _DCICON1_CSCKE_MASK                      0x00000200
#define _DCICON1_CSCKE_LENGTH                    0x00000001

#define _DCICON1_CSCKD_POSITION                  0x0000000A
#define _DCICON1_CSCKD_MASK                      0x00000400
#define _DCICON1_CSCKD_LENGTH                    0x00000001

#define _DCICON1_DLOOP_POSITION                  0x0000000B
#define _DCICON1_DLOOP_MASK                      0x00000800
#define _DCICON1_DLOOP_LENGTH                    0x00000001

#define _DCICON1_DCISIDL_POSITION                0x0000000D
#define _DCICON1_DCISIDL_MASK                    0x00002000
#define _DCICON1_DCISIDL_LENGTH                  0x00000001

#define _DCICON1_DCIEN_POSITION                  0x0000000F
#define _DCICON1_DCIEN_MASK                      0x00008000
#define _DCICON1_DCIEN_LENGTH                    0x00000001

#define _DCICON1_COFSM0_POSITION                 0x00000000
#define _DCICON1_COFSM0_MASK                     0x00000001
#define _DCICON1_COFSM0_LENGTH                   0x00000001

#define _DCICON1_COFSM1_POSITION                 0x00000001
#define _DCICON1_COFSM1_MASK                     0x00000002
#define _DCICON1_COFSM1_LENGTH                   0x00000001

#define _DCICON2_WS_POSITION                     0x00000000
#define _DCICON2_WS_MASK                         0x0000000F
#define _DCICON2_WS_LENGTH                       0x00000004

#define _DCICON2_COFSG_POSITION                  0x00000005
#define _DCICON2_COFSG_MASK                      0x000001E0
#define _DCICON2_COFSG_LENGTH                    0x00000004

#define _DCICON2_BLEN_POSITION                   0x0000000A
#define _DCICON2_BLEN_MASK                       0x00000C00
#define _DCICON2_BLEN_LENGTH                     0x00000002

#define _DCICON2_WS0_POSITION                    0x00000000
#define _DCICON2_WS0_MASK                        0x00000001
#define _DCICON2_WS0_LENGTH                      0x00000001

#define _DCICON2_WS1_POSITION                    0x00000001
#define _DCICON2_WS1_MASK                        0x00000002
#define _DCICON2_WS1_LENGTH                      0x00000001

#define _DCICON2_WS2_POSITION                    0x00000002
#define _DCICON2_WS2_MASK                        0x00000004
#define _DCICON2_WS2_LENGTH                      0x00000001

#define _DCICON2_WS3_POSITION                    0x00000003
#define _DCICON2_WS3_MASK                        0x00000008
#define _DCICON2_WS3_LENGTH                      0x00000001

#define _DCICON2_COFSG0_POSITION                 0x00000005
#define _DCICON2_COFSG0_MASK                     0x00000020
#define _DCICON2_COFSG0_LENGTH                   0x00000001

#define _DCICON2_COFSG1_POSITION                 0x00000006
#define _DCICON2_COFSG1_MASK                     0x00000040
#define _DCICON2_COFSG1_LENGTH                   0x00000001

#define _DCICON2_COFSG2_POSITION                 0x00000007
#define _DCICON2_COFSG2_MASK                     0x00000080
#define _DCICON2_COFSG2_LENGTH                   0x00000001

#define _DCICON2_COFSG3_POSITION                 0x00000008
#define _DCICON2_COFSG3_MASK                     0x00000100
#define _DCICON2_COFSG3_LENGTH                   0x00000001

#define _DCICON2_BLEN0_POSITION                  0x0000000A
#define _DCICON2_BLEN0_MASK                      0x00000400
#define _DCICON2_BLEN0_LENGTH                    0x00000001

#define _DCICON2_BLEN1_POSITION                  0x0000000B
#define _DCICON2_BLEN1_MASK                      0x00000800
#define _DCICON2_BLEN1_LENGTH                    0x00000001

#define _DCICON3_BCG_POSITION                    0x00000000
#define _DCICON3_BCG_MASK                        0x00000FFF
#define _DCICON3_BCG_LENGTH                      0x0000000C

#define _DCICON3_BCG0_POSITION                   0x00000000
#define _DCICON3_BCG0_MASK                       0x00000001
#define _DCICON3_BCG0_LENGTH                     0x00000001

#define _DCICON3_BCG1_POSITION                   0x00000001
#define _DCICON3_BCG1_MASK                       0x00000002
#define _DCICON3_BCG1_LENGTH                     0x00000001

#define _DCICON3_BCG2_POSITION                   0x00000002
#define _DCICON3_BCG2_MASK                       0x00000004
#define _DCICON3_BCG2_LENGTH                     0x00000001

#define _DCICON3_BCG3_POSITION                   0x00000003
#define _DCICON3_BCG3_MASK                       0x00000008
#define _DCICON3_BCG3_LENGTH                     0x00000001

#define _DCICON3_BCG4_POSITION                   0x00000004
#define _DCICON3_BCG4_MASK                       0x00000010
#define _DCICON3_BCG4_LENGTH                     0x00000001

#define _DCICON3_BCG5_POSITION                   0x00000005
#define _DCICON3_BCG5_MASK                       0x00000020
#define _DCICON3_BCG5_LENGTH                     0x00000001

#define _DCICON3_BCG6_POSITION                   0x00000006
#define _DCICON3_BCG6_MASK                       0x00000040
#define _DCICON3_BCG6_LENGTH                     0x00000001

#define _DCICON3_BCG7_POSITION                   0x00000007
#define _DCICON3_BCG7_MASK                       0x00000080
#define _DCICON3_BCG7_LENGTH                     0x00000001

#define _DCICON3_BCG8_POSITION                   0x00000008
#define _DCICON3_BCG8_MASK                       0x00000100
#define _DCICON3_BCG8_LENGTH                     0x00000001

#define _DCICON3_BCG9_POSITION                   0x00000009
#define _DCICON3_BCG9_MASK                       0x00000200
#define _DCICON3_BCG9_LENGTH                     0x00000001

#define _DCICON3_BCG10_POSITION                  0x0000000A
#define _DCICON3_BCG10_MASK                      0x00000400
#define _DCICON3_BCG10_LENGTH                    0x00000001

#define _DCICON3_BCG11_POSITION                  0x0000000B
#define _DCICON3_BCG11_MASK                      0x00000800
#define _DCICON3_BCG11_LENGTH                    0x00000001

#define _DCISTAT_TMPTY_POSITION                  0x00000000
#define _DCISTAT_TMPTY_MASK                      0x00000001
#define _DCISTAT_TMPTY_LENGTH                    0x00000001

